Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If the method has exactly one argument, then this argument is the cache key.
ja_jp: このメソッドが正確に1つの引数を持つ場合、この引数はキャッシュ・キーとなります。

source: If the method has multiple arguments but only one annotated with `@CacheKey`, then this annotated argument is the cache key.
ja_jp: メソッドに複数の引数があり、1つだけ `@CacheKey` でアノテーションされている場合、このアノテーションされた引数がキャッシュ・キーとなります。

source: If the method has no arguments, then the cache key is an instance of `io.quarkus.cache.DefaultCacheKey` built from the cache name.
ja_jp: このメソッドに引数がない場合、キャッシュ・キーはキャッシュ名から構築された `io.quarkus.cache.DefaultCacheKey` のインスタンスになります。

source: If the method name matches and the method is a bridge and synthetic method...
ja_jp: メソッド名が一致し、そのメソッドがブリッジで合成メソッドである場合...

source: If the metrics collection for this datasource is disabled, all values result in zero.
ja_jp: このデータ・ソースのメトリクス収集が無効な場合は、すべての値がゼロになります。

source: If the micro image does not suit your requirements, you can use https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[UBI- Minimal]. It's a bigger image, but contains more utilities and is closer to a full Linux distribution. Typically, it contains a package manager (`microdnf`), so you can install packages more easily.
ja_jp: もし、マイクロイメージが要件に合わない場合は、 link:https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[UBI- Minimal] を利用できます。UBI-Minimalは、より大きなイメージですが、より多くのユーティリティを含んでおり、完全なLinuxディストリビューションに近いものです。通常、パッケージマネージャー( `microdnf` )が含まれているので、より簡単にパッケージをインストールすることができます。

source: If the micro image does not suit your requirements, you can use https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[ubi8/ubi-minimal]. It's a bigger image, but contains more utilities and is closer to a full Linux distribution. Typically, it contains a package manager (`microdnf`), so you can install packages more easily.
ja_jp: もし、マイクロイメージが要件に合わない場合は、 https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[ubi8/ubi-minimal] を利用できます。ubi8/ubi-minimalは、比べるとサイズの大きなイメージですが、より多くのユーティリティを含んでおり、完全なLinuxディストリビューションに近いものです。特に、パッケージマネージャー( `microdnf` )が含まれているので、より簡単にパッケージをインストールすることができます。

source: If the micro image does not suit your requirements, you can use https://catalog.redhat.com/software/containers/ubi9-minimal/61832888c0d15aff4912fe0d[ubi9-minimal]. It's a bigger image, but contains more utilities and is closer to a full Linux distribution. Typically, it contains a package manager (`microdnf`), so you can install packages more easily.
ja_jp: マイクロイメージがあなたの要件に合わない場合、ubi link:https://catalog.redhat.com/software/containers/ubi9-minimal/61832888c0d15aff4912fe0d[9] -minimal を使うことができます。 これはより大きなイメージですが、より多くのユーティリティを含み、完全な Linux ディストリビューションに近いものです。典型的には、パッケージマネージャ ( `microdnf` ) が含まれているので、より簡単にパッケージをインストールできます。

source: If the missing entry is related to some resource, you should inspect the Quarkus build debug output and verify which resource patterns are being discarded, e.g.
ja_jp: 欠落しているエントリーが何らかのリソースに関連している場合、 Quarkus ビルドのデバッグ出力を調べて、どのリソースパターンが破棄されているかを確認する必要があります。例:

source: If the name is not specified via the `GrpcClient#value()` then the field name is used instead, e.g. `helloService` in this particular case.
ja_jp: `GrpcClient#value()` で名前が指定されていない場合は、代わりにフィールド名が使用されます。例えば、この例では `helloService` です。

source: If the newly registered stereotype annotation doesn't have the appropriate meta-annotations, such as scope or interceptor bindings, use an <<annotations_transformer_build_item,annotation transformation>> to add them.
ja_jp: 新しく登録されたステレオタイプアノテーションに、スコープやインターセプターのバインディングなどの適切なメタアノテーションがない場合、 link:#annotations_transformer_build_item[アノテーション変換] を使用してそれらを追加します。

source: If the offset is omitted, partitions are assigned to the consumer but won't be sought to offset.
ja_jp: オフセットが省略された場合、パーティションはコンシューマーに割り当てられますが、オフセットはシークされません。

source: If the outgoing record already contains a _key_, it *won't be overridden* by the incoming record key. If the incoming record does have a _null_ key, the `mp.messaging.outgoing.$channel.key` property is used.
ja_jp: 送信レコードにすでに _キー_ が含まれている場合、着信レコードキーによって *オーバーライドされません*。 着信レコードに _null_ キーがある場合は、 `mp.messaging.outgoing.$channel.key` プロパティーが使用されます。

source: If the output is present, this means that kernel argument to set cgroups to V1 has been applied. You can remove the kernel argument with the following command, re-enabling cgroups V2:
ja_jp: この出力があれば、cgroups を V1 に設定するカーネル引数が適用されたことを意味します。次のコマンドでカーネル引数を削除し、cgroups V2を再び有効にすることができます。

source: If the parameters do not pass the tests, it returns an HTTP 400 response. If the request accepts JSON payload, the response follows the https://opensource.zalando.com/problem/constraint-violation/[Problem] format.
ja_jp: パラメーターがテストに合格しなかった場合、HTTP 400 レスポンスを返します。リクエストが JSON ペイロードを受け入れる場合、レスポンスは https://opensource.zalando.com/problem/constraint-violation/[問題] のとおりの形式になります。

source: If the payload is unknown, you can also use the RESTEasy custom API instead. If that's the case, see the RESTEasy Multipart Providers link at the end of the guide.
ja_jp: ペイロードが不明な場合は、代わりにRESTEasy のカスタムAPIを使用することもできます。その場合は、ガイドの最後にある RESTEasy Multipart Providers のリンクを参照してください。

source: If the process cannot find the native image for some reason, or you want to test a native image that is no longer in the target directory you can specify the executable with the `-Dnative.image.path=` system property.
ja_jp: 何らかの理由でプロセスがネイティブイメージを見つけられない場合や、ターゲットディレクトリーにないネイティブイメージをテストしたい場合は、 `-Dnative.image.path=` システムプロパティーで実行ファイルを指定することができます。

source: If the processing completes successfully, _before committing the transaction_, the topic partition offsets of the given batch message will be committed to the transaction.
ja_jp: _トランザクションをコミットする前に_ 処理が正常に完了すると、指定されたバッチメッセージのトピックパーティションオフセットがトランザクションにコミットされます。

source: If the processing completes successfully, the message is acknowledged inside the transaction and the transaction is committed.
ja_jp: 処理が正常に完了すると、トランザクション内でメッセージが確認応答され、トランザクションがコミットされます。

source: If the processing completes successfully, the producer is flushed and the transaction is committed.
ja_jp: 処理が正常に完了すると、プロデューサーはフラッシュされ、トランザクションはコミットされます。

source: If the processing needs to abort, _after aborting the transaction_, the consumer's position is reset to the last committed offset, effectively resuming the consumption from that offset. If no consumer offset has been committed to a topic-partition, the consumer's position is reset to the beginning of the topic-partition, _even if the offset reset policy is `latest`_.
ja_jp: _トランザクションを中止した後に_ 、処理を中止する必要がある場合、コンシューマーの位置は最後にコミットされたオフセットにリセットされ、そのオフセットから消費を効果的に再開します。トピックパーティションにコンシューマーオフセットがコミットされていない場合は、_オフセットリセットポリシーが `latest` であっても_、コンシューマーの位置はトピックパーティションの先頭にリセットされます。

source: If the processing needs to abort, the message is nack'ed. One of the failure strategies can be employed in order to retry the processing or simply fail-stop. Note that the `Uni` returned from the `withTransaction` will yield a failure if the transaction fails and is aborted.
ja_jp: 処理を中止する必要がある場合、メッセージは否定応答されます。処理を再試行したり、フェイルストップしたりするために、いずれかの失敗ストラテジーを使用することができます。 トランザクションが失敗して中止された場合、 `withTransaction` から返される `Uni` は失敗することに注意してください。

source: If the processing throws an exception, returns a failing `Uni`, or marks the `TransactionalEmitter` for abort, the transaction is aborted.
ja_jp: 処理が例外を投げるか、失敗した `Uni` を返すか、あるいは `TransactionalEmitter` に中止のマークを付けると、トランザクションは中止されます。

source: If the project already exists, switch to the project:
ja_jp: プロジェクトがすでに存在する場合は、そのプロジェクトに切り替えます：

source: If the project does not exist, create a new project:
ja_jp: プロジェクトが存在しない場合は、新規プロジェクトを作成します：

source: If the project files have been updated since the last catalog update (limited to the module).
ja_jp: 最後のカタログ更新以降にプロジェクトファイルが更新されている場合（モジュールに限定）。

source: If the property `myMethod.cron.expr` is undefined or `null`, the default value (`0 0 15 ? * MON *`) will be used.
ja_jp: プロパティ `myMethod.cron.expr` が未定義または `null` の場合は、デフォルト値（ `0 0 15 ? * MON *` ）が使用されます。

source: If the provider is located in an extension, the configuration generator should be declared in the `annotationProcessorPaths` section of the runtime module using the default scope:
ja_jp: プロバイダがエクステンションに配置されている場合、設定ジェネレータは実行時モジュールの `annotationProcessorPaths` セクションでデフォルトのスコープを使用して宣言する必要があります。

source: If the provider metadata discovery has been successful then, after you open the main link:http://localhost:8080/q/dev[Dev UI page], you will see the `OpenID Connect Card` page linking to `Dev Console`:
ja_jp: プロバイダーメタデータの検出が成功した場合、メインの link:http://localhost:8080/q/dev[Dev UI ページ] を開くと、 `Dev Console` にリンクされた `OpenID Connect Card` ページが表示されます。

source: If the provider metadata discovery has been successful, then after you open the main link:http://localhost:8080/q/dev[Dev UI page], you can see the following *OpenID Connect* card referencing a `Google` provider:
ja_jp: プロバイダーメタデータの検出が成功した場合、メインの link:http://localhost:8080/q/dev[Dev UI ページ] を開くと、`Google` プロバイダーを参照する次の *OpenID Connect* カードが表示されます。

source: If the rebalance listener handles offset commit on behalf of the user (using the `NONE` commit strategy), the rebalance listener must commit the offset synchronously in the partitionsRevoked callback. We also recommend applying the same logic when the application stops.
ja_jp: リバランスリスナーがユーザーに代わってオフセットコミットを処理する場合 ( `NONE` コミットストラテジーを使用)、リバランスリスナーは partitionsRevoked コールバックでオフセットを同期的にコミットする必要があります。また、アプリケーションが停止したときに同じロジックを適用することをお勧めします。

source: If the recorder has multiple constructors you can annotate the one you want Quarkus to use with `@Inject`.
ja_jp: レコーダーに複数のコンストラクターがある場合は、 Quarkus に使用させたいものに `@Inject` を付与できます。

source: If the request to the GitHub API failed, clear a session cookie by performing a local session logout and return HTTP 401 status.
ja_jp: GitHub API へのリクエストが失敗した場合は、ローカルセッションログアウトを実行してセッションクッキーをクリアし、HTTP 401 ステータスを返します。

source: If the request to the GitHub API succeeded, initialize a template instance with the user email and the returned set of the private email addresses
ja_jp: GitHub API へのリクエストが成功した場合、ユーザーメールと返されたプライベートメールアドレスのセットでテンプレートインスタンスを初期化します。

source: If the resolved `Map` does not contain the value the default `Map` is used (exposed with the `default-kafka-broker` name)
ja_jp: 解決された `Map` に値が含まれていない場合、デフォルトの `Map` が使用されます (`default-kafka-broker` 名で公開)

source: If the returned `Uni` produces a failure (or is `null`), an HTTP 500 response is written.
ja_jp: 返された `Uni` が失敗した場合 (または `null` の場合)、HTTP 500 レスポンスが書き込まれます。

source: If the same instance of the `ConstraintValidator` bean can be used across the whole application, use the `@ApplicationScoped` scope.
ja_jp: アプリケーション全体で `ConstraintValidator` Bean の同じインスタンスを使用できる場合は、 `@ApplicationScoped` スコープを使用します。

source: If the sampler is parent based, there is no need to set, the now dropped property, `quarkus.opentelemetry.tracer.sampler.parent-based`.
ja_jp: サンプラーが親ベースである場合、現在廃止されたプロパティ `quarkus.opentelemetry.tracer.sampler.parent-based` を設定する必要はありません。

source: If the script engine sets an engine-specific request header itself, then you can register a custom `quarkus.oidc.JavaScriptRequestChecker` bean, which will inform Quarkus if the current request is a JavaScript request.
ja_jp: スクリプトエンジンがエンジン固有のリクエストヘッダー自体を設定する場合は、カスタム `quarkus.oidc.JavaScriptRequestChecker` Bean を登録できます。これにより、現在のリクエストが JavaScript リクエストであるかどうかが Quarkus に通知されます。

source: If the script engine sets an engine-specific request header itself, then you can register a custom `quarkus.oidc.JavaScriptRequestChecker` bean, which will inform Quarkus if the current request is a JavaScript request. For example, if the JavaScript engine sets a header such as `HX-Request: true`, then you can have it checked like this:
ja_jp: スクリプトエンジンがエンジン固有のリクエストヘッダーを設定する場合は、カスタム `quarkus.oidc.JavaScriptRequestChecker` Bean を登録できます。これにより、現在のリクエストが JavaScript リクエストであるかどうかが Quarkus に通知されます。たとえば、JavaScript エンジンが `HX-Request: true` などのヘッダーを設定する場合は、次のようにチェックできます。

source: If the targeted Kubernetes cluster is an OpenShift cluster, it is possible to access it through the `openshift-client` extension, in a similar way. This leverages the dedicated fabric8 openshift client, and provides access to `OpenShift` proprietary objects (e.g. `Route`, `ProjectRequest`, `BuildConfig` ...)
ja_jp: 対象となるKubernetesクラスターがOpenShiftクラスターであれば、同様の方法で、 `openshift-client` エクステンションを利用してアクセスすることが可能です。これは専用の fabric8 openshift クライアントを利用し、 `OpenShift` 固有のオブジェクト(例: `Route` , `ProjectRequest` , `BuildConfig` ...)へのアクセスを提供します。

source: If the tenant is enabled
ja_jp: テナントが有効かどうか

source: If the test instance lifecycle is `Lifecycle#PER_METHOD` (default) then the container is started during the `before each` test phase and stopped during the `after each` test phase. However, if the test instance lifecycle is `Lifecycle#PER_CLASS` then the container is started during the `before all` test phase and stopped during the `after all` test phase.
ja_jp: テストインスタンスのライフサイクルが `Lifecycle#PER_METHOD` (デフォルト) の場合、コンテナーは `before each` テストフェーズ中に起動し、 `after each` テストフェーズ中に停止します。 一方、テストインスタンスのライフサイクルが `Lifecycle#PER_CLASS` の場合、コンテナーは `before all` テストフェーズ中に起動し、 `after all` テストフェーズ中に停止します。

source: If the token is a JWT token then, by default, it will be verified with a `JsonWebKey` (JWK) key from a local `JsonWebKeySet` retrieved from the OpenID Connect Provider's JWK endpoint. The token's key identifier `kid` header value will be used to find the matching JWK key. If no matching `JWK` is available locally then `JsonWebKeySet` will be refreshed by fetching the current key set from the JWK endpoint. The `JsonWebKeySet` refresh can be repeated again only after the `quarkus.oidc.token.forced-jwk-refresh-interval` (default is 10 minutes) expires. If no matching `JWK` is available after the refresh then the JWT token will be sent to the OpenID Connect Provider's token introspection endpoint.
ja_jp: トークンが JWT トークンの場合、デフォルトでは、OpenID Connect プロバイダーの JWK エンドポイントから取得したローカルの `JsonWebKeySet` からの `JsonWebKey` (JWK) キーで検証されます。トークンのキー識別子 `kid` ヘッダー値は、一致する JWK キーを見つけるために使用されます。一致する `JWK` がローカルで利用できない場合、 `JsonWebKeySet` は、JWK エンドポイントから現在のキーセットを取得することによって更新されます。 `JsonWebKeySet` の更新は、 `quarkus.oidc.token.forced-jwk-refresh-interval` (デフォルトは 10 分) の期限が切れた後にのみ再度繰り返すことができます。更新後に一致する `JWK` が利用できない場合、JWT トークンは OpenID Connectプロバイダーのトークンイントロスペクションエンドポイントに送信されます。

source: If the token is a JWT token then, by default, it will be verified with a `JsonWebKey` (JWK) key from a local `JsonWebKeySet` retrieved from the OpenID Connect Provider's JWK endpoint. The token's key identifier `kid` header value will be used to find the matching JWK key. If no matching `JWK` is available locally then `JsonWebKeySet` will be refreshed by fetching the current key set from the JWK endpoint. The `JsonWebKeySet` refresh can be repeated only after the `quarkus.oidc.token.forced-jwk-refresh-interval` (default is 10 minutes) expires. If no matching `JWK` is available after the refresh then the JWT token will be sent to the OpenID Connect Provider's token introspection endpoint.
ja_jp: トークンが JWT トークンの場合、デフォルトでは、OpenID Connect プロバイダーの JWK エンドポイントから取得したローカルの `JsonWebKeySet` からの `JsonWebKey` (JWK) キーで検証されます。トークンのキー識別子 `kid` ヘッダー値は、一致する JWK キーを見つけるために使用されます。一致する `JWK` がローカルで利用できない場合、 `JsonWebKeySet` は、JWK エンドポイントから現在のキーセットを取得することによって更新されます。 `JsonWebKeySet` の更新は、 `quarkus.oidc.token.forced-jwk-refresh-interval` (デフォルトは 10 分) の期限が切れた後にのみ繰り返すことができます。更新後に一致する `JWK` が利用できない場合、JWT トークンは OpenID Connectプロバイダーのトークンイントロスペクションエンドポイントに送信されます。

source: If the token is a JWT token, then, by default, it is verified with a `JsonWebKey` (JWK) key from a local `JsonWebKeySet`, retrieved from the OIDC provider's JWK endpoint. The token's key identifier (`kid`) header value is used to find the matching JWK key. If no matching `JWK` is available locally, then `JsonWebKeySet` is refreshed by fetching the current key set from the JWK endpoint. The `JsonWebKeySet` refresh can be repeated only after the `quarkus.oidc.token.forced-jwk-refresh-interval` expires. The default expiry time is 10 minutes. If no matching `JWK` is available after the refresh, the JWT token is sent to the OIDC provider's token introspection endpoint.
ja_jp: トークンが JWT トークンの場合、デフォルトでは、OIDC プロバイダーの JWK エンドポイントから取得されたローカルの `JsonWebKeySet` の `JsonWebKey` (JWK) キーを使用してトークンが検証されます。 トークンのキー識別子 (`kid`) ヘッダー値は、一致する JWK キーを検出するために使用されます。 一致する `JWK` がローカルで利用できない場合は、JWK エンドポイントから現在のキーセットが取得され、 `JsonWebKeySet` が更新されます。 `JsonWebKeySet` の更新は、 `quarkus.oidc.token.forced-jwk-refresh-interval` の有効期限が切れた後にのみ繰り返すことができます。 デフォルトの有効期限は 10 分です。 一致する `JWK` が更新後に利用できない場合は、JWT トークンが OIDC プロバイダーのトークンイントロスペクションエンドポイントに送信されます。

source: If the token is opaque (binary) then a `scope` property from the remote token introspection response will be used.
ja_jp: トークンが不透明(バイナリー)の場合は、リモートトークンイントロスペクションレスポンスの `scope` プロパティーが使用されます。

source: If the token is opaque (binary), then a `scope` property from the remote token introspection response is used.
ja_jp: トークンが不透明 (バイナリー) の場合は、リモートトークンイントロスペクションレスポンスの `scope` プロパティーが使用されます。

source: If the token is opaque (it can be a binary token or an encrypted JWT token) then it will always be sent to the OpenID Connect Provider's token introspection endpoint.
ja_jp: トークンが不透明な場合 (バイナリートークンまたは暗号化された JWT トークンの場合があります)、常に OpenID Connectプロバイダーのトークンイントロスペクションエンドポイントに送信されます。

source: If the token is opaque, which means it can be a binary token or an encrypted JWT token, then it is always sent to the OIDC provider's token introspection endpoint.
ja_jp: トークンが不透明である場合、つまりバイナリートークンまたは暗号化された JWT トークンである場合、そのトークンは常に OIDC プロバイダーのトークンイントロスペクションエンドポイントに送信されます。

source: If the token source is BEARER then this path must point to a JWT bearer token in the file system
ja_jp: トークンソースが BEARER の場合、このパスはファイルシステム内の JWT ベアラートークンを指す必要があります

source: If the tokens have to be introspected and the introspection endpoint specific authentication mechanism is required then you can configure `quarkus-oidc` like this:
ja_jp: トークンをイントロスペクトする必要があり、イントロスペクションエンドポイント固有の認証メカニズムが必要な場合は次のように `quarkus-oidc` を設定することができます:

source: If the tokens have to be introspected and the introspection endpoint-specific authentication mechanism is required, you can configure `quarkus-oidc` as follows:
ja_jp: トークンをイントロスペクションする必要があり、イントロスペクションエンドポイント固有の認証メカニズムが必要な場合は、 `quarkus-oidc` を以下のように設定できます。

source: If the top-level `name` attribute is specified in the Compose file, it's used as the project name
ja_jp: Compose ファイルでトップレベルの `name` 属性が指定されている場合、それがプロジェクト名として使用されます。

source: If the topic is omitted, the configured topic will be used.
ja_jp: トピックが省略された場合、設定されたトピックが使用されます。

source: If the transaction block returns successfully (or completes with an item in case of the reactive API), the transaction is executed. Note that in this case, some transaction commands may succeed and some may fail; this is standard Redis behavior. The `TransactionResult.hasErrors()` method indicates whether at least one command failed. Results of failed commands in the `TransactionResult` are represented as ``Throwable``s. If the transaction block throws an exception (or completes with a failure in case of the reactive API), the transaction is discarded automatically and the exception is rethrown (or the resulting `Uni` completes with the same failure in case of the reactive API).
ja_jp: トランザクションブロックが正常に終了した場合 (リアクティブ API の場合はアイテムとともに完了した場合)、トランザクションが実行されます。この場合、一部のトランザクションコマンドが成功し、一部が失敗する可能性がありますが、これは Redis の標準的な動作であることに注意してください。 `TransactionResult.hasErrors()` メソッドは、少なくとも 1 つのコマンドが失敗したかどうかを示します。 `TransactionResult` 内の失敗したコマンドの結果は、 `Throwable` として表されます。トランザクションブロックが例外をスローした場合 (リアクティブ API の場合は失敗で完了した場合)、トランザクションは自動的に破棄され、例外が再スローされます (リアクティブ API の場合は、結果の `Uni` が同じ失敗で完了します)。

source: If the type is `java.util.List`, the `io.quarkus.arc.All` qualifier is added.
ja_jp: 型が `java.util.List` の場合、 `io.quarkus.arc.All` の修飾子が付加されます。

source: If the user authentication has failed at the OpenID Connect Authorization endpoint, for example, due to an invalid scope or other invalid parameters included in the redirect to the provider, then the provider will redirect the user back to Quarkus not with the `code` but `error` and `error_description` parameters.
ja_jp: OpenID Connect Authorization のエンドポイントでユーザー認証が失敗した場合、例えば、プロバイダーへのリダイレクトに含まれる無効なスコープやその他の無効なパラメーターが原因で、プロバイダーは `code` ではなく `error` で `error_description` パラメーターでユーザーを Quarkus にリダイレクトし直します。

source: If the user authentication requires Authorization Code flow or you need to support multiple tenants, use `quarkus-oidc`. `quarkus-oidc` can also request user information by using both Authorization Code Flow and Bearer access tokens.
ja_jp: ユーザー認証に認可コードフローが必要な場合、または複数のテナントをサポートする必要がある場合は、 `quarkus-oidc` を使用してください。 `quarkus-oidc` は、認可コードフローとベアラアクセストークンの両方を使用してユーザー情報を要求することもできます。

source: If the user authentication requires Authorization Code flow, or you need to support multiple tenants, use `quarkus-oidc`. `quarkus-oidc` can also request user information by using both Authorization Code Flow and Bearer access tokens.
ja_jp: ユーザー認証に認可コードフローが必要な場合、または複数のテナントをサポートする必要がある場合は、 `quarkus-oidc` を使用してください。 `quarkus-oidc` は、認可コードフローとベアラーアクセストークンの両方を使用して、ユーザー情報を要求することもできます。

source: If the user credentials are provided by different sources, you can combine authentication mechanisms. For example, you can combine built-in `Basic` and `quarkus-oidc` `Bearer` authentication mechanisms.
ja_jp: ユーザ認証情報が異なるソースから提供される場合、認証メカニズムを組み合わせることができます。 例えば、組み込みの `Basic` および `quarkus-oidc` `Bearer` 認証メカニズムを組み合わせることができます。

source: If the user name is `Alice` and the password is `secret`, the HTTP authorization header would be `Authorization: Basic QWxjZTpzZWNyZXQ=`, where `QWxjZTpzZWNyZXQ=` is a Base64 encoded representation of the `Alice:secret` string.
ja_jp: ユーザー名が `Alice` でパスワードが `secret` の場合、HTTP認証ヘッダーは `Authorization: Basic QWxjZTpzZWNyZXQ=` となり、 `QWxjZTpzZWNyZXQ=` は `Alice:secret` の文字列をBase64でエンコードしたものです。

source: If the user name is `Alice` and the password is `secret`, the HTTP authorization header would be `Authorization: Basic QWxpY2U6c2VjcmV0`, where `QWxpY2U6c2VjcmV0` is a Base64 encoded representation of the `Alice:secret` string.
ja_jp: ユーザー名が `Alice` でパスワードが `secret` の場合、HTTP 認証ヘッダーは `Authorization: Basic QWxpY2U6c2VjcmV0` となります。ここで、 `QWxpY2U6c2VjcmV0` は `Alice:secret` 文字列の Base64 エンコード表現です。

source: If the users access the `/run` endpoint before the authentication, then, once they have authenticated and been redirected to the configured redirect path such as `/strava`, they will land on the original request `/run` path.
ja_jp: ユーザーが認証前に `/run` エンドポイントにアクセスした場合、認証後に `/strava` など、設定されたリダイレクトパスにリダイレクトされると、元のリクエストの `/run` パスに移動します。

source: If the value for the `schema` property matches a https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/common/schema/SchemaType.html[Schema Type] a simple schema will be created with that type and will be used for that channel.
ja_jp: `schema` プロパティーの値が https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/common/schema/SchemaType.html[スキーマタイプ] と一致する場合、そのタイプを使用した単純なスキーマが作成され、該当するチャネルに使用されます。

source: If the value is a number followed by `d`, it is prefixed with `P`.
ja_jp: 数値の後に `d` が続く場合は、その前に `P` が付けられます。

source: If the value is a number followed by `h`, `m`, or `s`, it is prefixed with `PT`.
ja_jp: 数値の後に `h` 、 `m` 、 `s` が続く場合は、その前に `PT` が付けられます。

source: If the value is a number followed by `ms`, it represents time in milliseconds.
ja_jp: 数値の後に `ms` が続く場合は、ミリ秒単位の時間を表します。

source: If the value is only a number, it represents time in seconds.
ja_jp: 数値のみの場合は、秒単位の時間を表します。
